[
  {
    "category": "architecture",
    "name": "repo_setup",
    "passing": true,
    "description": "Bootstrap the project with the entry point script, data models, and tools directory. Creates the agent entry point as a single-file UV script, the tools/ directory with stubs for all 12 tools, and the Pydantic models for game state input (MatchupState, RosterState, OpponentRosterState).",
    "steps": [
      "Create the agent entry point script with a PEP 723 inline metadata block declaring dependencies (anthropic, pydantic, pybaseball)",
      "Create the tools/ directory with an __init__.py and one .py file per tool (all 12 tools as stubs that return placeholder JSON)",
      "Define MatchupState, RosterState, and OpponentRosterState as Pydantic models in models.py, matching the schemas from DESIGN.md",
      "Define a simple DecisionOutput model in models.py with fields: action (bool), decision_type (str | None), tweet_text (str), reasoning (str)",
      "Wire up the entry point to instantiate the Claude Agent SDK client, register all 12 tool stubs, and accept a game state JSON as input",
      "Verify the project runs with 'uv run agent.py <game_state.json>' -- the agent receives a game state, can call stub tools, and returns a plain-text decision"
    ]
  },
  {
    "category": "architecture",
    "name": "claude_agent_sdk",
    "passing": true,
    "description": "The agent is built on the Claude Agent SDK. The SDK manages the tool-use loop: sending the game state to Claude, dispatching tool calls for information gathering, and receiving the agent's plain-text decision as output.",
    "steps": [
      "The agent is instantiated using the Claude Agent SDK client (anthropic package)",
      "All 12 information-gathering tools are registered as SDK tool definitions with input schemas",
      "The SDK manages the conversation loop: sending the game state and processing tool-use responses",
      "The agent's system prompt instructs it to act as a baseball manager that gathers context via tools and responds with a plain-text decision",
      "Tool call results are returned to the agent via the SDK's tool result mechanism",
      "The agent can call multiple tools in a single turn to gather all needed context",
      "After gathering sufficient context, the agent produces a plain-text decision as its final response",
      "The SDK handles retries and error formatting when the agent makes an invalid tool call"
    ]
  },
  {
    "category": "architecture",
    "name": "single_file_uv_scripts",
    "passing": false,
    "description": "All Python scripts are single-file UV executables. Each script includes an inline PEP 723 metadata block declaring its dependencies so it can be run directly with 'uv run script.py' without a separate requirements file or virtual environment.",
    "steps": [
      "Each .py file begins with a PEP 723 inline metadata block (/// script) declaring its dependencies",
      "Scripts can be executed directly via 'uv run <script>.py' with no prior install step",
      "No requirements.txt, pyproject.toml, or setup.py is needed",
      "All dependencies including anthropic, pydantic, and pybaseball are declared inline",
      "The main entry point can be run with 'uv run agent.py <game_state.json>'"
    ]
  },
  {
    "category": "data",
    "name": "mlb_stats_api_client",
    "passing": false,
    "description": "Core client for the MLB Stats API (statsapi.mlb.com). Provides functions to fetch rosters, player metadata, and live game state. This is the foundation that the external service and tools build on.",
    "steps": [
      "Implement a data/mlb_api.py module with functions for common MLB Stats API endpoints",
      "Fetch current 26-man active roster for a team by team ID or name",
      "Fetch player metadata: name, position, handedness (bats/throws), jersey number",
      "Fetch live game feed by gamePk: current inning, outs, count, runners, score, batter, pitcher",
      "Fetch game schedule by date to find active gamePks",
      "Fetch batter-vs-pitcher career stats from the API's vsPlayer endpoint",
      "Map MLB Stats API player IDs to the fields needed by MatchupState, RosterState, and OpponentRosterState models",
      "Handle API errors gracefully: connection failures, invalid IDs, off-season empty responses",
      "Add request timeout and basic retry logic for transient failures"
    ]
  },
  {
    "category": "data",
    "name": "statcast_player_stats",
    "passing": false,
    "description": "Integration with pybaseball to fetch real Statcast and FanGraphs player statistics. Provides season stats, splits, advanced metrics, and pitch-level data for use by the player stats tools.",
    "steps": [
      "Add pybaseball as an inline dependency in the relevant scripts",
      "Fetch real batting stats: AVG, OBP, SLG, OPS, wOBA, wRC+, barrel rate, xwOBA, K%, BB%, chase rate, whiff rate, GB%, pull%, exit velocity, launch angle, sprint speed",
      "Fetch real pitching stats: ERA, FIP, xFIP, K%, BB%, GB%, pitch mix with per-pitch velocity/spin/whiff rates",
      "Support split queries: vs LHB/RHB, home/away, by filtering Statcast data or using FanGraphs splits",
      "Fetch pitcher times-through-order wOBA splits",
      "Fetch defensive metrics: OAA, DRS, UZR by position",
      "Fetch catcher metrics: pop time, framing runs",
      "Implement a local cache layer (JSON files in data/cache/) so repeated lookups do not re-fetch from the network",
      "Cache entries expire after 24 hours to balance freshness with rate-limit friendliness"
    ]
  },
  {
    "category": "data",
    "name": "batter_vs_pitcher_history",
    "passing": false,
    "description": "Fetch real batter-vs-pitcher matchup history from the MLB Stats API or pybaseball. Provides actual career head-to-head plate appearance results for use by the matchup data tool.",
    "steps": [
      "Use the MLB Stats API vsPlayer endpoint or pybaseball to fetch career matchup data",
      "Retrieve career plate appearances, at-bats, hits, doubles, triples, home runs, walks, strikeouts, batting average, slugging, OPS",
      "When the matchup has fewer than 10 plate appearances, flag as small sample",
      "Cache matchup lookups in data/cache/matchups/ to avoid redundant API calls during a game",
      "Handle cases where one or both players have no MLB history (rookies) by returning an empty result",
      "Return a consistent JSON schema regardless of data availability"
    ]
  },
  {
    "category": "data",
    "name": "retrosheet_run_expectancy",
    "passing": false,
    "description": "Pre-computed run expectancy matrices and win probability tables derived from real Retrosheet play-by-play data. These static lookup tables back the run expectancy and win probability tools.",
    "steps": [
      "Include a data/compute_re_matrix.py script that parses Retrosheet event files and computes the 24-state run expectancy matrix",
      "Compute win probability tables indexed by (inning, half, outs, base state, score differential) from historical game outcomes",
      "Compute leverage index values for each game state from the win probability table",
      "Write computed tables to JSON files in data/ (re_matrix.json, win_probability.json, leverage_index.json)",
      "Include pre-computed tables for recent seasons in the repository so tools work without running the computation script",
      "The computation script is idempotent and can be re-run when new Retrosheet data is available"
    ]
  },
  {
    "category": "data",
    "name": "data_caching",
    "passing": false,
    "description": "Caching layer for API responses to avoid redundant network calls during a game. Player stats, matchup data, and roster info are cached locally with configurable expiry.",
    "steps": [
      "Implement a data/cache.py module with get/set/invalidate functions",
      "Cache is file-based (JSON files in data/cache/) for simplicity",
      "Cache keys are derived from the API endpoint and parameters (player ID, season, split type)",
      "Default TTL is 24 hours for season stats, 1 hour for live game data",
      "Cache can be manually cleared via a CLI flag or by deleting the cache directory",
      "All data-fetching functions in the data layer check cache before making network requests"
    ]
  },
  {
    "category": "tool",
    "name": "get_batter_stats",
    "passing": false,
    "description": "Retrieves real batting statistics from Statcast/FanGraphs for a player. Returns traditional stats, advanced metrics, plate discipline, batted ball profile, and sprint speed. Supports splits by handedness, home/away, and recency.",
    "steps": [
      "Accepts a player identifier (MLB player ID or name) and optional split parameters (vs_hand: L/R, home_away, recency_window)",
      "Queries the statcast_player_stats data layer to fetch real stats",
      "Returns traditional stats: AVG, OBP, SLG, OPS",
      "Returns advanced metrics: wOBA, wRC+, barrel rate, xwOBA",
      "Returns plate discipline: K%, BB%, chase rate, whiff rate",
      "Returns batted ball profile: GB%, pull%, exit velocity, launch angle",
      "Returns sprint speed",
      "Returns situational stats: RISP, high leverage, late and close",
      "Returns an error if the player is not found"
    ]
  },
  {
    "category": "tool",
    "name": "get_pitcher_stats",
    "passing": false,
    "description": "Retrieves real pitching statistics from Statcast/FanGraphs for a pitcher. Returns ERA/FIP/xFIP, strikeout and walk rates, ground ball rate, pitch mix with per-pitch metrics, and times-through-order splits.",
    "steps": [
      "Accepts a player identifier and optional split parameters (vs_hand: L/R, home_away, recency_window)",
      "Queries the statcast_player_stats data layer to fetch real stats",
      "Returns ERA, FIP, xFIP, SIERA",
      "Returns K% and BB%",
      "Returns ground ball rate and batted ball distribution",
      "Returns pitch mix with per-pitch velocity, spin rate, and whiff rate",
      "Returns times-through-order wOBA splits (1st, 2nd, 3rd+)",
      "Returns an error if the player is not found"
    ]
  },
  {
    "category": "tool",
    "name": "get_matchup_data",
    "passing": false,
    "description": "Retrieves real batter-vs-pitcher career history from the MLB Stats API. Returns direct matchup results, sample-size indicator, and pitch-type vulnerability breakdown. For small samples, supplements with similarity-based projections.",
    "steps": [
      "Accepts a batter identifier and a pitcher identifier",
      "Queries the batter_vs_pitcher_history data layer for real matchup data",
      "Returns number of career plate appearances between the two players",
      "Returns batting average, slugging, and strikeout rate for the matchup",
      "Returns outcome distribution (groundball, flyball, line drive rates) when available",
      "Returns a sample-size reliability indicator (small/medium/large)",
      "When sample is small (<10 PA), returns a similarity-model projected wOBA",
      "Returns a meaningful response when no prior matchup history exists",
      "Returns an error if either player identifier is invalid"
    ]
  },
  {
    "category": "tool",
    "name": "get_run_expectancy",
    "passing": false,
    "description": "Returns expected runs for a given base-out state, probability of scoring at least one run, and the run distribution. Backed by the pre-computed 24-state run expectancy matrix from Retrosheet data.",
    "steps": [
      "Accepts base state (runners on 1st, 2nd, 3rd in any combination) and out count (0, 1, 2)",
      "Loads the pre-computed RE matrix from data/re_matrix.json",
      "Returns expected runs from this state to end of inning",
      "Returns probability of scoring at least one run",
      "Returns run distribution (probability of scoring exactly 0, 1, 2, 3+ runs)",
      "Returns the run expectancy change for common transitions (successful steal, caught stealing, sacrifice bunt)"
    ]
  },
  {
    "category": "tool",
    "name": "get_win_probability",
    "passing": false,
    "description": "Returns win probability, leverage index, and conditional win probabilities given the full game state. Backed by pre-computed win probability tables from historical game outcomes.",
    "steps": [
      "Accepts inning, half (top/bottom), outs, base state, and score differential",
      "Optionally accepts home/away indicator for the managed team",
      "Loads pre-computed WP and LI tables from data/win_probability.json and data/leverage_index.json",
      "Returns current win probability for the managed team",
      "Returns leverage index for the current situation",
      "Returns conditional win probability if a run scores",
      "Returns conditional win probability if the inning ends scoreless"
    ]
  },
  {
    "category": "tool",
    "name": "evaluate_stolen_base",
    "passing": false,
    "description": "Evaluates a potential stolen base attempt given runner speed, pitcher hold time, catcher arm, and current base-out state. Returns success probability, breakeven rate, expected run-expectancy change, and a recommendation.",
    "steps": [
      "Accepts runner identifier, target base, pitcher identifier, and catcher identifier",
      "Fetches real runner sprint speed and SB success rate from Statcast",
      "Fetches real catcher pop time from Statcast",
      "Returns estimated success probability based on runner speed, pitcher hold time, and catcher pop time",
      "Returns breakeven success rate for this base-out state (from RE matrix)",
      "Returns expected run-expectancy change if successful vs caught",
      "Returns net expected run-expectancy change (weighted by success probability)",
      "Returns a textual recommendation (favorable, marginal, unfavorable)",
      "Returns an error if any player identifier is invalid"
    ]
  },
  {
    "category": "tool",
    "name": "evaluate_sacrifice_bunt",
    "passing": false,
    "description": "Evaluates whether a sacrifice bunt is optimal given the batter, base-out state, score differential, and inning. Compares bunt vs swing-away expected runs and probability of scoring at least one run.",
    "steps": [
      "Accepts batter identifier, base-out state, score differential, and inning",
      "Returns expected runs if bunting vs swinging away (from RE matrix transitions)",
      "Returns probability of scoring at least one run if bunting vs swinging away",
      "Returns net expected value comparison (bunt advantage or disadvantage)",
      "Returns a textual recommendation with context (e.g., bunt may be favorable in 1-run game late)",
      "Returns an error if the player identifier is invalid"
    ]
  },
  {
    "category": "tool",
    "name": "get_bullpen_status",
    "passing": false,
    "description": "Returns detailed status of all bullpen pitchers for the managed team. Combines roster availability from the game state with real season stats from Statcast/FanGraphs.",
    "steps": [
      "Reads bullpen availability from the RosterState input (availability, freshness, rest days, pitch counts)",
      "Supplements each pitcher with real season stats from the statcast_player_stats data layer",
      "Each pitcher includes: role, availability status, freshness, days since last appearance, recent pitch counts",
      "Each pitcher includes: platoon splits (vs LHB and RHB wOBA), ERA, FIP, K%, BB%",
      "Each pitcher includes: current warm-up state",
      "Pitchers already used and removed are excluded"
    ]
  },
  {
    "category": "tool",
    "name": "get_pitcher_fatigue_assessment",
    "passing": false,
    "description": "Assesses the current pitcher's fatigue based on in-game trends from the live game feed: velocity changes, spin rate decline, batted ball quality trend, pitch count, times through order, and an overall fatigue rating.",
    "steps": [
      "Accepts a pitcher identifier (defaults to current pitcher if omitted)",
      "Uses in-game data from the live game feed (passed via game state or fetched from MLB Stats API)",
      "Returns velocity change from first inning to most recent inning",
      "Returns spin rate change from first inning to most recent inning",
      "Returns pitch count and pitch count by inning",
      "Returns times through order and historical TTO penalty data",
      "Returns an overall fatigue level rating (fresh, normal, fatigued, gassed)",
      "Returns an error if the pitcher is not in the current game"
    ]
  },
  {
    "category": "tool",
    "name": "get_defensive_positioning",
    "passing": false,
    "description": "Returns recommended infield and outfield positioning for a given batter-pitcher matchup and game situation. Uses the batter's real spray chart data from Statcast.",
    "steps": [
      "Accepts batter identifier, pitcher identifier, and current game situation (outs, runners, score, inning)",
      "Fetches the batter's real spray chart data from Statcast (pull%, center%, oppo% for groundballs and flyballs)",
      "Returns recommended infield positioning (standard, in, double-play depth, shift direction)",
      "Returns recommended outfield positioning (standard, shallow, deep, shaded direction)",
      "Returns infield-in cost/benefit analysis (expected runs saved at home vs extra hits allowed)",
      "Recommendations comply with current MLB infield positioning rules (2 infielders each side of 2nd base)",
      "Returns an error if either player identifier is invalid"
    ]
  },
  {
    "category": "tool",
    "name": "get_defensive_replacement_value",
    "passing": false,
    "description": "Evaluates the net value of a defensive substitution by comparing the defensive upgrade against the offensive downgrade, scaled by estimated innings remaining. Uses real defensive metrics from Statcast.",
    "steps": [
      "Accepts the current fielder identifier and the potential replacement identifier",
      "Accepts the fielding position for the substitution",
      "Fetches real defensive metrics (OAA, DRS) from Statcast for both players at the specified position",
      "Returns the defensive upgrade in OAA or DRS difference",
      "Returns the offensive downgrade in projected wOBA or wRC+",
      "Returns estimated innings remaining based on current game state",
      "Returns net expected value of the substitution (defensive gain minus offensive cost)",
      "Returns a textual recommendation (favorable, marginal, unfavorable)",
      "Returns an error if either player identifier is invalid"
    ]
  },
  {
    "category": "tool",
    "name": "get_platoon_comparison",
    "passing": false,
    "description": "Compares a potential pinch hitter against the current batter for the active matchup. Returns projected wOBA for each, platoon advantage delta, defensive cost, and bench depth impact. Uses real stats from Statcast/FanGraphs.",
    "steps": [
      "Accepts the current batter identifier, potential pinch hitter identifier, and current pitcher identifier",
      "Fetches real platoon split stats for both batters from Statcast/FanGraphs",
      "Returns projected wOBA vs the current pitcher for each batter",
      "Returns the platoon advantage delta between the two batters",
      "Returns the defensive cost of the substitution (current fielder vs replacement's defensive ability)",
      "Returns the bench depth impact (remaining bench options after the substitution)",
      "Returns an error if any player identifier is invalid"
    ]
  },
  {
    "category": "functional",
    "name": "game_state_ingestion",
    "passing": false,
    "description": "The external service pushes a game state JSON payload to the agent before each at-bat. This feature handles parsing the MLB Stats API live game feed response into the agent's input models (MatchupState, RosterState, OpponentRosterState).",
    "steps": [
      "Accept a raw game state JSON payload (either MLB Stats API format or a pre-parsed intermediate format)",
      "Parse the payload into MatchupState, RosterState, and OpponentRosterState Pydantic models",
      "Map MLB Stats API player IDs to the fields expected by each model",
      "Populate pitcher in-game stats from the live feed (pitch count, batters faced, times through order, today's line)",
      "Populate runner data (sprint speed, SB success rate) by cross-referencing with Statcast data",
      "Populate bullpen availability and freshness from the game feed and recent game logs",
      "Populate bench availability based on substitution history in the current game",
      "Track mound visits remaining and replay challenge availability",
      "Validate the parsed models and return clear errors for missing or invalid data"
    ]
  },
  {
    "category": "functional",
    "name": "agent_system_prompt",
    "passing": false,
    "description": "The system prompt provided to the Claude agent instructs it to act as a baseball manager for a specific team. It explains the tools available, the analytical framework, MLB rules, and the expected plain-text output format.",
    "steps": [
      "Establish the agent's identity as the manager of a specific MLB team",
      "List all 12 available tools with brief descriptions of when to use each one",
      "Instruct the agent to assess the situation and determine whether action is needed before calling tools",
      "Embed key analytical constants (TTO penalty, platoon splits, breakeven rates, leverage index thresholds)",
      "Include all MLB rules that constrain decisions (3-batter minimum, mound visits, positioning rules, etc.)",
      "Instruct the agent that its output is plain-text describing the decision, suitable for tweeting",
      "Explain that most at-bats require no action and the agent should only make active decisions when the situation warrants it",
      "Note that players removed from the game cannot return",
      "Store the system prompt in a separate markdown file (AGENT_PROMPT.md) loaded at runtime"
    ]
  },
  {
    "category": "functional",
    "name": "agent_decision_engine",
    "passing": false,
    "description": "The core decision function. Receives a parsed game state, sends it to the Claude agent with the system prompt and tools, and returns the agent's plain-text decision. This is a single-shot invocation per at-bat, not a persistent game loop.",
    "steps": [
      "Accept MatchupState, RosterState, and OpponentRosterState as input",
      "Format the game state as a natural-language scenario description for the agent",
      "Send the scenario to the Claude agent with all 12 tools registered",
      "The agent may call zero or more tools to gather analytical context",
      "The agent produces a plain-text response: either 'no action' or an active decision with reasoning",
      "Return the agent's response along with metadata (tools called, token usage)",
      "Handle agent errors gracefully: if the agent fails to produce a valid response after retries, return a safe 'no action' default"
    ]
  },
  {
    "category": "functional",
    "name": "decision_output",
    "passing": false,
    "description": "Formats the agent's decision for output. Active decisions are formatted as tweet-ready text. All decisions (active and no-action) are logged for analysis.",
    "steps": [
      "If the agent made an active decision, extract the tweet-ready portion of the response",
      "Ensure the tweet text fits within ~280 characters (truncate or summarize if needed)",
      "Include game context in the tweet (inning, situation, teams)",
      "For no-action responses, format a brief log entry but do not produce tweet output",
      "Return both the tweet text (if applicable) and the full reasoning (for logging)"
    ]
  },
  {
    "category": "functional",
    "name": "decision_logging",
    "passing": true,
    "description": "Every agent invocation is logged with full context so decisions can be analyzed after the fact. Enables evaluating the agent's managerial quality and debugging decisions.",
    "steps": [
      "Each log entry includes the game state at the time of the decision (inning, score, outs, runners, batter/pitcher)",
      "The entry includes which tools the agent called and with what parameters",
      "The entry includes the tool results the agent received",
      "The entry includes the agent's full response (decision text and reasoning)",
      "The entry includes whether the decision was active or no-action",
      "The entry includes token usage and latency",
      "Logs are written to structured JSON files organized by game (one file per game)",
      "Timestamps are included for correlating with the live game timeline"
    ]
  },
  {
    "category": "functional",
    "name": "error_handling",
    "passing": false,
    "description": "Handles failures gracefully across the system: MLB API errors, Statcast data unavailability, Claude API rate limits, invalid game state inputs, and tool execution failures.",
    "steps": [
      "MLB Stats API failures (connection errors, timeouts, 404s) return clear error messages without crashing",
      "Statcast/pybaseball data unavailability falls back to reduced-context decisions (agent decides with fewer stats)",
      "Claude API rate limits (429) trigger exponential backoff retry",
      "Invalid game state inputs are rejected with validation errors before reaching the agent",
      "Tool execution failures return error responses to the agent so it can decide without that tool's data",
      "Repeated agent failures (>3 retries) fall back to a safe 'no action' response",
      "All errors are logged with context for debugging"
    ]
  },
  {
    "category": "functional",
    "name": "live_game_feed_service",
    "passing": false,
    "description": "The external service that polls the MLB Stats API live game feed, detects new at-bats, and invokes the agent. This is the orchestrator that drives the agent during a live game.",
    "steps": [
      "Accept a gamePk (MLB game ID) and the team the agent manages",
      "Poll the MLB Stats API live game feed at a configurable interval (default 10 seconds)",
      "Detect when a new at-bat begins by comparing the current play index to the previous poll",
      "When a new at-bat is detected, parse the game state and invoke the agent",
      "If the agent returns an active decision, format it as a tweet and output it",
      "Continue polling until the game reaches a final state",
      "Handle game delays, rain delays, and the feed going temporarily unavailable without crashing",
      "Log all agent invocations and decisions throughout the game"
    ]
  },
  {
    "category": "functional",
    "name": "tweet_integration",
    "passing": false,
    "description": "Posts the agent's active decisions to Twitter/X during live games. Connects the decision output to the Twitter API.",
    "steps": [
      "Accept tweet-ready text from the decision output module",
      "Post the tweet via the Twitter/X API (using tweepy or similar library)",
      "Include relevant hashtags or game context (team names, inning)",
      "Handle Twitter API rate limits and errors gracefully",
      "Log all posted tweets with timestamps and tweet IDs",
      "Support a dry-run mode that logs tweets without posting them (for testing)"
    ]
  },
  {
    "category": "technical",
    "name": "input_validation_layer",
    "passing": false,
    "description": "All tool inputs are validated against their schemas before execution. Game state inputs are validated before reaching the agent. This ensures clear error messages for invalid data.",
    "steps": [
      "Each tool has a Pydantic input model with required and optional parameters",
      "Parameters are type-checked before processing",
      "Enum parameters (vs_hand: L/R, recency_window) reject invalid values",
      "Player identifiers are validated as valid MLB player IDs",
      "Game state inputs are validated against the MatchupState/RosterState/OpponentRosterState schemas",
      "Validation errors include which parameter failed and what was expected"
    ]
  },
  {
    "category": "technical",
    "name": "structured_tool_responses",
    "passing": false,
    "description": "All tool responses use a consistent JSON format so the agent can reliably parse and reason about the data.",
    "steps": [
      "Every tool returns a JSON object with a consistent top-level structure (success/error status, data payload)",
      "Numeric values use consistent units and formats (e.g., batting average as 0.300)",
      "Player references include both the MLB player ID and display name",
      "Error responses include an error code and a human-readable message",
      "When data is unavailable for a field, the field is present with a null value and an explanation, not omitted"
    ]
  },
  {
    "category": "technical",
    "name": "api_rate_limit_handling",
    "passing": false,
    "description": "Handles rate limits from both the Claude API and external data APIs (MLB Stats API, Statcast/FanGraphs via pybaseball). Uses exponential backoff and respects Retry-After headers.",
    "steps": [
      "Claude API rate limit (429) responses trigger exponential backoff retry with jitter",
      "MLB Stats API rate limits are handled with backoff and reduced polling frequency",
      "pybaseball/FanGraphs rate limits are mitigated by the data caching layer",
      "A maximum retry count is enforced to avoid infinite retry loops",
      "Rate limit events are logged with timestamps",
      "The system respects Retry-After headers when provided"
    ]
  }
]
